<?php
$_SERVER['APIPHP']['Config']['core\Filter']=[
	'rule'=>[
        'email'=>'',//邮箱
        'ip'=>'',//IP地址
        'mac'=>'',//MAC地址
        'convert_type'=>'',//按模板转换数据类型
        //以上规则自定义无效

        //以下规则可修改
        'domain'=>'/([a-z0-9]+(-?[a-z0-9])*\.)*[a-z]{2,}/i',//域名
        'url'=>'/^https?://([a-z0-9]+(-?[a-z0-9])*\.)*[a-z]{2,}/?([a-z0-9-_.~%]+/?)*(\?([a-z0-9-_.~]+(=[a-z0-9-_.~]+&?)?)*)?(#[-a-z0-9_:]+)?$/i',//URL
        'url_port'=>'/^https?://([a-z0-9]+(-?[a-z0-9])*\.)*[a-z]{2,}((:\d+)?/)?([a-z0-9-_.~%]+/?)*(\?([a-z0-9-_.~]+(=[a-z0-9-_.~]+&?)?)*)?(#[-a-z0-9_:]+)?$/i',//URL
        'price'=>'/^\d+[.]?\d{0,2}$/',//价格（精确到分）
		'cn_mobile'=>'/^1[0-9]{10}$/',  //中国大陆11位手机手机号
		'cn_phone'=>'/^0[1-9][0-9]{1,2}\-[0-9]{5,8}$/',  //中国大陆固定电话（分机号请单独验证）
		'cn_idcard'=>'/^[1-9](\d{5})(\d{4})(0|1)(\d)(0|1|2|3)(\d)(\d{3})([0-9]|X)$/',  //中国大陆身份证号
		'cn_name'=>'/^([\u4e00-\u9fa5][\u4e00-\u9fa5·]{1,25})$/',  //中国大陆姓名（含少数民族姓名中的点符号）
		'cn_username'=>'/^[a-zA-Z0-9_\u4e00-\u9fa5]+$/',//中文用户名&昵称
		'en_username'=>'/^[0-9a-zA-Z_]+$/',//英文用户名&昵称
		'password'=>'/^(?=.*?[a-zA-Z])(?=.*?[0-9])[a-zA-Z0-9_\-\+\,\.\!\$\*\(\)\[\]\{\};:<>#@&=]+$/',//普通强度密码，必须含有字母、数字，其它字符仅限于以下字符之内：_-+,.!$*()[]{};:<>#@&=
		'password+'=>'/^(?=.*?[a-z])(?=.*?[A-Z])(?=.*?[0-9])[a-zA-Z0-9_\-\+\,\.\!\$\*\(\)\[\]\{\};:<>#@&=]+$/',  //中级强度密码，必须含有大写字母、小写字母、数字，其它字符仅限于以下字符之内：_-+,.!$*()[]{};:<>#@&=
		'password++'=>'/^(?=.*?[a-z])(?=.*?[A-Z])(?=.*?[0-9])(?=.*?[_\-\+\,\.\!\$\*\(\)\[\]\{\};:<>#@&=])[a-zA-Z0-9_\-\+\,\.\!\$\*\(\)\[\]\{\};:<>#@&=]+$/',  //高级强度密码，必须含有且仅限于大写字母、小写字母、数字、特殊字符，特殊字符仅限于以下字符之内：_-+,.!$*()[]{};:<>#@&=
	]
];